package com.company.module_1.Lesson_2;

public class Lesson_2 {

    public static void main(String[] args) {

//Задание 1
//Напишите программу, где ввожу число n,
// и если оно между 10 и 20, то программа выведет YES иначе NO.

//        Scanner in = new Scanner(System.in);
//        int n = in.nextInt();
//        if (n<=20 && n>=10) {
//            System.out.println("Yes:");
//        }else {
//            System.out.println("No:");
//        }

//  Задание 2
//      Напишите программу где я ввожу сумму внесенной валюты и выберу на какую валюту хочу перевести.
//      (Курс USD – 420, EUR – 490, GBP - 550)
//
//      Ввод:                           Вывод:
//      Insert amount in KZT:           2.04 EUR
//      1000
//      Choose currency:
//      [1] USD
//      [2] EUR
//      [3] GBP
//      2

//        Scanner in = new Scanner(System.in);
//        double c = in.nextDouble();
//        int USD = 420;
//        int EUR = 490;
//        int GBP = 550;
//        int cur = in.nextInt();
//            if (cur == 1) {
//                System.out.println("USD:"+c/420);
//            }else if(cur == 2){
//                System.out.println("EUR:"+c/490);
//            }
//            else if(cur == 3){
//                System.out.println("GBP:"+c/550);

//  Задание 3
//      Напишите программу, где я ввожу целостное число a и b, и если a делиться на b,
//      то программа должна вывести divisible иначе not divisible.
//      *** Подсказка: Есть такой оператор %, % показывает остаток числа.
//      Например, 10%4 будет равна 2, так как когда мы делим 10 на 4, остаток у нас будет 2

//        Scanner in = new Scanner(System.in);
//        int a = in.nextInt();
//        int b = in.nextInt();
////        int x = (a % b);
////        System.out.println("x=" + x);
//        boolean x = true;
//        if (a % b == 0) {
//            System.out.println("divisible");
//        } else {
//            System.out.println("not divisible");
//        }

//  Задание 7
//      Напишите программу где я ввожу логин и пароль.
//      И если они совпадают, то мы выводим Authentication completed, иначе Invalid login or password.
//      (Логин должен быть user, пароль - qwerty)
//      *** Подсказка: Сравнение строк вы делаете с помощью метода equals().
//
//  Например, строка name = "test"
//      name.equals("test") возвращает true
//      name.equals("other") возвращает false
//
//  Ввод:                     Вывод:
//  Insert Login:             Invalid login or password
//  ilyas
//  Insert Password:
//  qwerty

//  Ввод:                     Вывод:
//  Insert Login:             Authentication completed
//  user
//  Insert Password:
//  qwerty
//
//        Scanner in = new Scanner(System.in);
//        System.out.println("Insert Login");
//        String a = in.next();
//        System.out.println("Insert Password");
//        String b = in.next();
//        System.out.println("a=" + a);
//        boolean String;
//        if (a.equals("user")) {
//            System.out.println("Authentication completed");
//        } else {
//            System.out.println("Invalid login or password");
//        }
//        ;
//        if (b.equals("qwerty")) {
//            System.out.println("Authentication completed");
//        } else {
//            System.out.println("Invalid login or password");
//        }


    }

}
